function 黑暗决斗7()
  hideHUD(胜负)
  次=0

  while true do
    电()
    常用界面7()
    mSleep(ttt) 

    黑暗有卷7x,黑暗有卷7y= findColor({696, 397, 879, 461}, "0|0|0x518802,-38|-6|0xcccc9f,-50|3|0xe2be5c,-28|11|0xf3ca7b,19|0|0xb3b3a4,67|-17|0xa4de56,62|17|0x619413,-160|-250|0x3f44a8,-29|13|0xe0c390", 95, 0, 0, 0)
    黑暗没卷7x,黑暗没卷7y= 找颜色(0x575a4b,"1|1|0x1b2606,3|2|0x828576,5|2|0xfaf6ec", 95, 799, 434, 810, 443)
    中场7x,中场7y= 找颜色(0x765441,"5|0|0x733519,1|3|0x5b4134,4|5|0x593715", 95, 736, 225, 744, 233)
    --领奖7x,领奖7y= 找颜色(0x3c3c3c,"3|1|0x494c38,5|2|0xa0ac78,8|3|0xb8cd7b", 95, 590, 707, 603, 715)

    ---（（（（下面顺序不能变））））
    if 黑暗有卷7x> -1 then
      sysLog('黑暗有卷7x')
      点击(790,430)
      次=0
    elseif 黑暗没卷7x> -1 then
      lua_exit()
      -- if 用钱==1 then
      --   点击(790,430)
      --   次=0
      -- else
      -- end
    elseif 主界面7x> -1 then
      sysLog('主界面7x')
      点击2(1010, 370)
    elseif 决斗场7x> -1 then
      sysLog('找黑暗的入口')
      -- 滑一下
      sysLog('开始滑动')
      touchDown(1, 120, 580); --在 (120, 580) 按下
      for i = 0, 460, 10 do   --使用for循环连续滑动
          touchMove(1, 120, 580 - i); 
          mSleep(40);        --延迟
      end
      touchUp(1, 120, 580 - 460); --在 (120, 120) 抬起

      mSleep(1000)
      黑暗入口位置7()
      sysLog('找到入口')
      点击(黑暗入口位置7x, 黑暗入口位置7y)
    elseif 手动中7x> -1 and 可手动==0 then
      if 竞技认输==1 then
        点击(43, 111)
        mSleep(700)
        投降位置7()
        点击(投降位置7x, 投降位置7y)
        点击2(700, 420)
      else
        点击(40, 180)
      end
    elseif 自动中7x> -1 then
      if 竞技认输==1 then
        点击(43, 111)
        mSleep(700)
        投降位置7()
        点击(投降位置7x, 投降位置7y)
        点击2(700, 420)
      else
        mSleep(3*ttt) -- 点击(10,220)
      end
    elseif 中场7x> -1 then
      sysLog('中场7x, 游戏结算阶段')
      点击(660,680)
      次=0
    elseif 自动中7x> -1 then
      mSleep(3*ttt) -- 点击(10,220)
    end

    不常用界面7()
    少用界面7()
    防闪退7()
  end
end