function 黑暗决斗7()
hideHUD(胜负)
次=0
while true do

电()
常用界面7()
mSleep(ttt) 

黑暗有卷7x,黑暗有卷7y= 找颜色(0x826649,"2|1|0x3d311f,3|2|0x281d19,5|3|0x946c3f", 95, 753, 424, 765, 431)
黑暗没卷7x,黑暗没卷7y= 找颜色(0x575a4b,"1|1|0x1b2606,3|2|0x828576,5|2|0xfaf6ec", 95, 799, 434, 810, 443)
中场7x,中场7y= 找颜色(0x765441,"5|0|0x733519,1|3|0x5b4134,4|5|0x593715", 95, 736, 225, 744, 233)
--领奖7x,领奖7y= 找颜色(0x3c3c3c,"3|1|0x494c38,5|2|0xa0ac78,8|3|0xb8cd7b", 95, 590, 707, 603, 715)
---（（（（下面顺序不能变））））
if 黑暗有卷7x> -1 then
点击(790,430)
次=0
elseif 黑暗没卷7x> -1 then
if 用钱==1 then
点击(790,430)
次=0
else
lua_exit()
end
elseif 主界面7x> -1 then
点击2(1010, 370)
elseif 决斗场7x> -1 then
点击(160,725)
elseif 手动中7x> -1 and 次<1 then
	if 竞技认输==1 then
    点击(43, 111)
    mSleep(700)
    点击(300, 111)
    点击2(700, 420)
		次=次+1
else
    点击(40, 180)
		次=次+1
		end
elseif 中场7x> -1 then 
点击(660,680)
次=0
elseif 自动中7x> -1 then
mSleep(3*ttt) -- 点击(10,220)
end
不常用界面7()
少用界面7()

end
end