function 常用界面4s()
主界面4x,主界面4y= 找颜色(0xd6e8ef,"2|12|0xdef2f8,17|4|0xfcfffe,25|7|0xfef7f4,27|10|0x11416c", 95, 633, 332, 667, 351)
决斗场4x,决斗场4y= 找颜色(0x8597bb,"13|9|0x697993,4|24|0xb4b4ff,18|24|0x161616", 95, 391, 205, 427, 254)
--决斗场4x,决斗场4y= 找颜色(0x525250,"10|12|0xd7d3cb,17|12|0x4d4d4c,27|14|0x040507", 95, 538, 526, 573, 545)
--决斗场4x,决斗场4y= 找颜色(0x86909f,"11|6|0xfdf8ef,21|12|0x293f61,28|14|0x183056", 95, 548, 584, 582, 603)
手动中4x,手动中4y= 找颜色(0x626d8a,"3|3|0xe2e2ee,6|7|0xd8d4f4,7|25|0xfceaaa", 95, 20, 130, 50, 193)
--手动中4x,手动中4y= 找颜色(0xcdc191,"6|6|0xb6ae85,8|11|0xfbe9a9,8|17|0xb4ac85", 95, 2, 169, 27, 193)
自动中4x,自动中4y= 找颜色(0xa2a081,"4|6|0xfceaaa,9|10|0xd9cc97,14|17|0x85836b", 95, 5, 168, 26, 192)
胜利4x,胜利4y= 找颜色(0xcd8444,"29|16|0xd1d1d1,94|16|0xffffff,163|39|0x696969", 95, 704, 133, 901, 205)
失败4x,失败4y= 找颜色(0x426a9e,"20|19|0xc8c8c8,102|-12|0xffffff,210|26|0x737373", 95, 671, 136, 911, 204)
平局4x,平局4y= 找颜色(0x83b94d,"33|15|0x0b0e09,89|43|0x141f08,159|49|0x65a523", 95, 678, 127, 877, 215)
零点重置4x,零点重置4y= 找颜色(0x697d67,"4|6|0xaad287,13|14|0xadd789,19|18|0x373b4e", 95, 546, 256, 569, 281)
end

function 不常用界面4s()
决斗重置4x,决斗重置4y= 找颜色(0x2f3148,"-22|31|0xc7f589,-23|186|0xabe461,46|211|0x4f8203", 95, 399, 221, 559, 464)
断线4x,断线4y= 找颜色(0x98d746,"9|6|0x606552,22|14|0x808471,39|18|0xfffaf0,45|19|0x4e8003", 95, 431, 327, 529, 384)
升级4x,升级4y= 找颜色(0xfccb27,"10|15|0xff9409,35|5|0xfcbe15,39|19|0x000006", 95, 451, 132, 509, 185)
认输4x,认输4y= 找颜色(0xd5d1cf,"6|6|0xb2afb3,12|12|0xfffaf0,18|17|0x414259", 95, 275, 257, 298, 280)
活动界面4x,活动界面4y= 找颜色(0x494c56,"3|2|0xb9b6b1,11|3|0xa2a09d,23|4|0x141929", 95, 193, 31, 221, 40)
今日任务4x,今日任务4y= 找颜色(0xdef0ef,"6|3|0x454959,10|5|0x0e1a3d,15|5|0x04165f", 95, 371, 154, 387, 176)
广告4x,广告4y= 找颜色(0xef490b,"5|2|0xfbfffc,15|9|0xe2907d,22|14|0xab1e11", 95, 847, 57, 872, 83)
段位4x,段位4y= 找颜色(0xd7e0e3,"5|3|0x8d979c,9|5|0x1b2136,13|5|0x00145e", 95, 371, 96, 388, 116)
任务领奖4x,任务领奖4y= 找颜色(0xbfc302,"7|4|0xfeef02,15|10|0xfd9602,25|13|0xae5005", 95, 102, 85, 134, 104)
领奖成功4x,领奖成功4y= 找颜色(0xfefdff,"74|36|0xffffff,143|25|0x030303,196|44|0x0c0e03", 95, 348, 206, 608, 282)
--领奖成功4x,领奖成功4y= 找颜色(0xd9be63,"18|9|0x555555,42|19|0xe1e1e1,56|28|0x958a57", 95, 347, 215, 480, 287)
人物4x,人物4y= 找颜色(0xc9ac31,"4|7|0x62460f,10|12|0xb77111,19|16|0x955807", 95, 531, 126, 563, 150)
角色4x,角色4y= 找颜色(0x3e3d3b,"6|0|0x1a1815,14|0|0x937c51,20|0|0xead18f", 95, 56, 283, 80, 298)
冒险4x,冒险4y= 找颜色(0x1f2741,"15|0|0xa7a5a1,27|0|0xfffaf0,45|1|0x0a0d16", 95, 191, 30, 253, 41)
教学4x,教学4y= 找颜色(0xc28169,"7|0|0x0a366c,13|0|0xe8f2ba,16|0|0xc4593a", 95, 423, 102, 443, 110)
旅行4x,旅行4y= 找颜色(0x4d4c4b,"8|1|0x556172,14|2|0x24436b,21|3|0x090807", 95, 98, 295, 127, 311)
排行4x,排行4y= 找颜色(0xb7c0c3,"5|3|0x586265,9|5|0x181f3b,16|5|0x00115e", 95, 371, 53, 390, 75)
图鉴4x,图鉴4y= 找颜色(0xe0eaeb,"4|2|0x707c7f,8|4|0x0b122e,13|5|0x01155f", 95, 371, 45, 390, 67)
邮件4x,邮件4y= 找颜色(0xe3eeef,"4|2|0xa5b3b5,8|4|0x21273b,13|5|0x091e66", 95, 371, 62, 390, 84)
签到4x,签到4y= 找颜色(0xe6eff0,"4|2|0x929fa0,7|4|0x8b9699,12|4|0x172c71", 95, 370, 28, 392, 50)
金币4x,金币4y= 找颜色(0xedb820,"5|0|0xa48e32,10|0|0xd0a724,16|0|0xfecc1a", 95, 278, 204, 299, 216)
充值4x,充值4y= 找颜色(0xe97c5a,"11|0|0x013962,21|0|0x88404f,27|0|0xfbe5a7", 95, 169, 192, 208, 207)
战绩4x,战绩4y= 找颜色(0x014b99,"12|6|0x0856a0,27|12|0xa39aaf,36|17|0xfaf67d", 95, 374, 116, 426, 144)
卡组4x,卡组4y= 找颜色(0x1d2835,"5|3|0x8c7f34,13|10|0xc4ae07,18|18|0x7c6e02", 95, 830, 481, 854, 508)
战报4x,战报4y= 找颜色(0xe3eeef,"4|2|0xa5b3b5,8|4|0x21273b,13|5|0x091e66", 95, 371, 62, 388, 83)
end

function 多用界面4s()
if 主界面4x> -1  then
点击2(690,300)
elseif 决斗场4x> -1  then 
点击2(580,490)
elseif 手动中4x> -1  then 
点击2(35,155)
elseif 自动中4x> -1  then 
mSleep(1000)--点击2(20,480)
elseif 胜利4x> -1  then 
点击2(310,580)
elseif 失败4x> -1  then 
点击2(310,585)
elseif 平局4x> -1  then 
点击2(310,585)
elseif 零点重置4x> -1  then 
点击2(473,366)
end
end

function 少用界面4s()
if 升级4x> -1  then
点击2(450,448)
elseif 断线4x> -1  then
点击2(480,350)
elseif 决斗重置4x> -1  then
点击2(480,430)
elseif 认输4x> -1  then
点击2(508,366)
elseif 活动界面4x> -1  then
点击2(60,30)
elseif 今日任务4x> -1  then
点击2(411,162)
elseif 广告4x> -1  then
点击2(859,72)
elseif 段位4x> -1  then
点击2(768,117)
elseif 任务领奖4x> -1  then
点击2(865,70)
elseif 领奖成功4x> -1  then
点击2(472,571)
elseif 人物4x> -1  then
点击2(800,78)
elseif 角色4x> -1  then
点击2(60,30)
elseif 冒险4x> -1  then
点击2(60,30)
elseif 教学4x> -1  then
点击2(862,58)
elseif 旅行4x> -1  then
点击2(60,30)
elseif 排行4x> -1  then
点击2(869,77)
elseif 图鉴4x> -1  then
点击2(808,70)
elseif 邮件4x> -1  then
点击2(861,86)
elseif 签到4x> -1  then
点击2(868,52)
elseif 金币4x> -1  then
点击2(733,130)
elseif 充值4x> -1  then
点击2(60,30)
elseif 战绩4x> -1  then
点击2(738,97)
elseif 卡组4x> -1  then
点击2(60,30)
elseif 战报4x> -1  then
点击2(842,85)
end
end

function 可领奖4s()
mSleep(ttt)
if  可领奖==1 then
while true do
常用界面4s()
不常用界面4s()
if 主界面4x> -1  then   
点击(690,300)
elseif 决斗场4x> -1  then 
break
elseif 签到4x> -1  then  
点击(868,52)
elseif 领奖成功4x> -1  then 
点击(472,571)	
end
end
mSleep(ttt)
点击(320,470)  --进入每日领奖
mSleep(ttt)
点击(530,310)   --领取1
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(530,310)   --领取2
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(530,310)   --领取3
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(530,310)   --领取4
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(530,310)   --领取5
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(863,70)    --结束每日领奖回到决斗场
mSleep(ttt)
点击(60,30)     --返回主界面
mSleep(2*ttt)
点击(411,162)   --清除每日任务
mSleep(ttt)
点击(628,88)   --点击任务领取
mSleep(ttt)
点击(790,545)   --点击任务领取5
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(630,545)   --点击任务领取4
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(470,545)   --点击任务领取3
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(320,545)   --点击任务领取2
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(170,545)   --点击任务领取1
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(250,135)   --点击宝箱领取1
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(345,135)   --点击宝箱领取2
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(445,135)   --点击宝箱领取3
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(535,135)   --点击宝箱领取4
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(680,135)   --点击宝箱领取5
mSleep(ttt)
点击(470,570)   --返回
mSleep(ttt)
点击(860,72)   --返回主界面
mSleep(ttt)
else
mSleep(ttt)
点击(60,30)    --回到主界面
mSleep(ttt)
end
end

function 防闪退4s()
if 闪退==1 then
flag = appIsRunning("com.gamest.fight.city.ol"); 
if flag == 0 then --如果没有运行
闪退次数=闪退次数+1
	runApp("com.gamest.fight.city.ol") --运行QQ
mSleep(20000)
点击(480,490)
mSleep(25000)
点击(470,565)
mSleep(1000)
end
end
end