function 竞技之门7()
-- hideHUD(胜负)
  while true do
    while true do
      电()
      常用界面7()
      不常用界面7()
      mSleep(ttt) 
      
      if 胜>=设置胜场jjha then   --假如胜利场数达到UI里面设置的胜场数
        mSleep(100)
        结束()
        lua_exit();
      end

      -- 竞技之门有卷7x,竞技之门有卷7y= findColor({808, 619, 999, 720}, "0|0|0xa7a4a4,-61|-25|0xbeee7f,67|-19|0xb6ea71,-63|19|0x5b8e0d,70|19|0x5c8f0e,-15|-12|0x1854c8,-2|-14|0x1d56ca,-14|7|0x0a3391", 95, 0, 0, 0)
      竞技之门有卷7x,竞技之门有卷7y= findColor({586, 581, 1013, 745}, "0|0|0x072170,-76|-24|0x9ce240,-76|27|0x689a20,76|26|0x699d1c,77|-21|0xc3f08c,-2|-8|0x2452be,-13|-8|0x1a54d7,-20|11|0x083797,-7|15|0x0f2a92,39|6|0x528a02", 90, 0, 0, 0)
      竞技之门没卷7x,竞技之门没卷7y= 找颜色(0x1d2a07,"1|1|0x22300a,3|2|0x1a1e10,6|2|0x7c7e6e", 95, 922, 679, 932, 686)
      竞技有牌7x,竞技有牌7y= 找颜色(0x222816,"1|0|0x818375,3|1|0x979889,4|1|0x666a59", 95, 1281, 521, 1291, 528)
      竞技没牌7x,竞技没牌7y= 找颜色(0x222733,"1|1|0x19337a,2|3|0x183175,3|4|0xc4c3c1", 95, 897, 98, 903, 105)
      人物选择7x,人物选择7y= findColor({267, 462, 852, 717}, "0|0|0xf4a232,4|39|0xf49f35,188|41|0xf6a536,194|0|0xf49f34,224|111|0xb2e869,142|133|0x518602,326|128|0x5a9807,215|124|0xfffaf0",  95, 0, 0, 0)
      
      if 主界面7x> -1 then
        点击2(1010, 370)
      elseif 决斗场7x> -1 then
        点击(120,580)
      elseif 竞技之门有卷7x> -1 then
        sysLog('竞技之门有卷7x')
        点击(790,670)
      elseif 竞技之门没卷7x> -1 then
        -- if 用钱==1 then
        --   点击(900,670)
        -- else
        -- end
        lua_exit()
      elseif 竞技有牌7x> -1 and 可手动==1 then
        mSleep(ttt)
        领奖励7x,领奖励7y= 找颜色(0x300d02,"2|0|0x190702,3|0|0x423732,4|0|0xa09891", 95, 777, 438, 784, 443)
        if 领奖励7x> -1 then
          点击(785,430)
          break
        end
        if 直接撕券==1 then
          点击(1145,515)
          mSleep(1000)
          点击(730,410)
          break
        end
        点击(785,430)
        mSleep(ttt)
        for xx=1,60,1 do
          mSleep(ttt)
          常用界面7()
          if 手动中7x> -1 then
            点击(40, 180)
            break
          end
        end
      elseif 竞技有牌7x> -1 and 可手动==0 then
        sysLog('竞技有牌7x')
        mSleep(ttt)
        领奖励7x,领奖励7y= 找颜色(0x300d02,"2|0|0x190702,3|0|0x423732,4|0|0xa09891", 95, 777, 438, 784, 443)
        if 领奖励7x> -1 then
          -- dialog("4", 5)
          点击(785,430)
          sysLog('领奖励成功，已点击')
          break
        end
        if 直接撕券==1 then
          点击(1145,515)
          mSleep(1000)
          点击(730,410)
          break
        end
        点击(785,430)
      elseif 竞技没牌7x> -1 then
        sysLog('竞技没牌7x')
        if 自动牌组==1 then
          -- 选牌7()
          -- 选牌7()、
          选取(380,400,20,300)
          选取(580,400,20,300)
          -- mSleep(100)
          选取(380,400,20,300)
          选取(580,400,20,300)
          -- mSleep(100)
          选取(380,400,20,300)
          选取(580,400,20,300)
          -- mSleep(100)
          选取(380,400,20,300)
          选取(580,400,20,300)
          -- mSleep(100)
          选取(380,400,20,300)
          选取(580,400,20,300)
        end
      elseif 人物选择7x> -1 then
        sysLog('人物选择7x')
        if 自动选人物==1 then
          点击(590,640)
        end
      elseif 手动中7x> -1 and 可手动==0 then
        if 竞技认输==1 then
          -- 刚进去会点不到右上角，需要等待一段时间
          mSleep(5000)

          点击(43, 111)
          mSleep(700)
          投降位置7()
          点击(投降位置7x, 投降位置7y)
          点击2(700, 420)
        else
          点击(40, 180)
        end
      elseif 自动中7x> -1 then
        if 竞技认输==1 then
          -- 刚进去会点不到右上角，需要等待一段时间
          mSleep(5000)

          点击(43, 111)
          mSleep(700)
          投降位置7()
          点击(投降位置7x, 投降位置7y)
          点击2(700, 420)
        else
          mSleep(3*ttt) -- 点击(10,220)
        end
      elseif 胜利7x> -1 then
        点击(465, 678)
        胜=胜+1
        showHUD(胜负,"胜 "..胜.."场 ".."负 "..负.." 场 ".."平 "..平.."场",20,"0xffff0000","0xffffffff",0,150,0,300,20)
      elseif 失败7x> -1 then 
        点击(465, 678)
        负=负+1
        showHUD(胜负,"胜 "..胜.."场 ".."负 "..负.." 场 ".."平 "..平.."场",20,"0xffff0000","0xffffffff",0,150,0,300,20)
      elseif 平局7x> -1 then 
        点击(465, 678)
        平=平+1
        showHUD(胜负,"胜 "..胜.."场 ".."负 "..负.." 场 ".."平 "..平.."场",20,"0xffff0000","0xffffffff",0,150,0,300,20)
      end
      
      少用界面7()
      防闪退7()
    end
  end
end